stubs/__files/partner/psl/read_equipment_49_761_2000_76H1.xml

<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<SOAP:Envelope xmlns:SOAP='http://schemas.xmlsoap.org/soap/envelope/'>
    <SOAP:Header/>
    <SOAP:Body>
        <ns1:MT_EQDATA_RESPV2 xmlns:ns1='http://telekom.de/xi/NGERP_EXTD_PSL_INT/global/WMS/Equipment/Read/V2'>
            <eiMessageContext>
                <target xmlns='http://messaging.ei.tmobile.net/datatypes'>SI_ReadEquipmentResponseV2In_DigiOSS</target>
                <requestId xmlns='http://messaging.ei.tmobile.net/datatypes'>
                    urn:uuid:2976f8db-4094-46c3-9273-b4cb85ce9f4f
                </requestId>
                <timeLeft xmlns='http://messaging.ei.tmobile.net/datatypes'>172800000</timeLeft>
                <priority xmlns='http://messaging.ei.tmobile.net/datatypes'>4</priority>
                <sender xmlns='http://messaging.ei.tmobile.net/datatypes'>sndr:tmo.erp.sap.architecture.SAP:PI</sender>
                <correlationId xmlns='http://messaging.ei.tmobile.net/datatypes'>e54b10d0-6432-4520-9f88-1af20820ce47
                </correlationId>
            </eiMessageContext>
            <data>
                <MT_EQDATA_RESPV2>
                    <EQUI>
                        <ENDSZ>49/761/2000/76H1</ENDSZ>
                        <HEQUI>204012171</HEQUI>
                        <HEQNR>0056</HEQNR>
                        <ASB>7</ASB>
                        <TPLNR>000761-002000-001-001-002-005</TPLNR>
                        <EQART>G</EQART>
                        <ANZ_EBENEN>1</ANZ_EBENEN>
                        <EQUNR>7610794010</EQUNR>
                        <SERGE>MA58007610794010</SERGE>
                        <SUBMT>40916237</SUBMT>
                        <ADR_ID>25886993</ADR_ID>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/761/2000/76H1</ENDSZ>
                        <HEQUI>7610794010</HEQUI>
                        <HEQNR>0001</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>7610794011</EQUNR>
                        <SERGE>H902FL7610794011</SERGE>
                        <SUBMT>40916243</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/761/2000/76H1</ENDSZ>
                        <HEQUI>7610794010</HEQUI>
                        <HEQNR>0002</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>7610794012</EQUNR>
                        <SERGE>H902FL7610794012</SERGE>
                        <SUBMT>40916243</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/761/2000/76H1</ENDSZ>
                        <HEQUI>7610794010</HEQUI>
                        <HEQNR>0003</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>7610794013</EQUNR>
                        <SERGE>H902FL7610794013</SERGE>
                        <SUBMT>40916243</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/761/2000/76H1</ENDSZ>
                        <HEQUI>7610794010</HEQUI>
                        <HEQNR>0004</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>7610794014</EQUNR>
                        <SERGE>H902FL7610794014</SERGE>
                        <SUBMT>40916243</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/761/2000/76H1</ENDSZ>
                        <HEQUI>7610794010</HEQUI>
                        <HEQNR>0005</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>7610794015</EQUNR>
                        <SERGE>H902FL7610794015</SERGE>
                        <SUBMT>40916243</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/761/2000/76H1</ENDSZ>
                        <HEQUI>7610794010</HEQUI>
                        <HEQNR>0006</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>7610794016</EQUNR>
                        <SERGE>H902FL7610794016</SERGE>
                        <SUBMT>40916243</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/761/2000/76H1</ENDSZ>
                        <HEQUI>7610794010</HEQUI>
                        <HEQNR>0007</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>7610794017</EQUNR>
                        <SERGE>H902NX7610794017</SERGE>
                        <SUBMT>40916244</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/761/2000/76H1</ENDSZ>
                        <HEQUI>7610794010</HEQUI>
                        <HEQNR>0008</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>7610794018</EQUNR>
                        <SERGE>H902MP7610794018</SERGE>
                        <SUBMT>40916239</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/761/2000/76H1</ENDSZ>
                        <HEQUI>7610794010</HEQUI>
                        <HEQNR>0010</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>7610794019</EQUNR>
                        <SERGE>H902PI7610794019</SERGE>
                        <SUBMT>40916246</SUBMT>
                    </EQUI>
                    <KOPF>
                        <PARTNER>{{xPath request.body '//data/MT_EQDATA_REQ/KOPF/PARTNER/text()'}}</PARTNER>
                        <ANFO_KEN>{{xPath request.body '//data/MT_EQDATA_REQ/KOPF/ANFO_KEN/text()'}}</ANFO_KEN>
                    </KOPF>
                    <STATUS>
                        <LOG_NO>0000000000</LOG_NO>
                        <NUMBER>000</NUMBER>
                        <SYSTEM>Linux</SYSTEM>
                        <LOG_NO>string</LOG_NO>
                        <ID>ZDIB</ID>
                        <MESSAGE>Die Anforderung wurde ausgeführt.</MESSAGE>
                        <TYPE>S</TYPE>
                    </STATUS>
                </MT_EQDATA_RESPV2>
            </data>
        </ns1:MT_EQDATA_RESPV2>
    </SOAP:Body>
</SOAP:Envelope>